#+TITLE: Differentiable programming for scientists and engineers


** Make tensor from values and indices with a default value

We can use indexing to create arrays in numpy. Consider this example to make an identity matrix.

#+BEGIN_SRC python :results output org drawer
import numpy as np

a = np.zeros((3, 3))

a[[0, 1, 2], [0, 1, 2]] = [1, 2, 3]

print(a)
#+END_SRC

#+RESULTS:
:RESULTS:
[[ 1.  0.  0.]
 [ 0.  2.  0.]
 [ 0.  0.  3.]]
:END:

pydoc:tensorflow.sparse_to_dense is the way to create this as a tensor from the indices and values. You specify the indices where values are known, the shape of the /dense/ tensor that you want, and the values at the indices.

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf

a = tf.sparse_to_dense(sparse_indices=[[0, 0], [1, 1], [2, 2]],
                       output_shape=(3, 3),
                       sparse_values=[1, 2, 3])

with tf.Session() as sess:
    print(a.eval())
    print()
    # This is the simplest way to make this particular tensor
    print(tf.diag([1, 2, 3]).eval())
    print()
    # Here is another simple way
    print((tf.eye(3, 3, dtype=tf.int32) * tf.constant([1, 2, 3])).eval())
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
[[1 0 0]
 [0 2 0]
 [0 0 3]]

[[1 0 0]
 [0 2 0]
 [0 0 3]]

[[1 0 0]
 [0 2 0]
 [0 0 3]]
#+END_SRC


** Accumulating a sum
   :PROPERTIES:
   :ID:       29E4682F-DE66-4C84-904D-00334228B8C4
   :END:

Here are two ways in Python you might accumulate a sum using a for loop.

#+BEGIN_SRC python :results output org drawer
sum = 0

for i in range(5):
    sum += i

print(sum)

import numpy as np
print(np.sum(np.arange(5)))
#+END_SRC

#+RESULTS:
:RESULTS:
10
10
:END:

In TF, we use an approach more like numpy to accumulate the sum. pydoc:tensorflow.reduce_sum

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf

sum = tf.reduce_sum(tf.range(5))

with tf.Session() as sess:
    print(sum.eval())
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
10
#+END_SRC

For more complex operations that work iteratively there are pydoc:tensorflow.foldl and pydoc:tensorflow.foldr. These functions map a function onto the unpacked elements of a tensor. The function takes arguments of the last function value, and the current element. You can think of pydoc:tensorflow.foldl as working from the first element to the last, and pydoc:tensorflow.foldr working from the last to the first.

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf

sum = tf.foldl(lambda acc, curr: acc + curr, tf.range(5))

with tf.Session() as sess:
    print(sum.eval())
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
10
#+END_SRC

We can also use a loop-like approach in tensorflow. The syntax is quite different than Python though. You have to define two functions, one for the conditional part of the loop, and one for the body of the loop. Both functions take all the loop variables. Here we have two loop variables we need to track: a counter, and the accumulated sum. We want the loop to proceed as long as the counter is less than 5. We create this in a lambda function since it is just one line. In the body we have to accumulate the sum and increment the counter. The body function should return both of these values.

Finally, we pass initial values of the loop_vars to the while_loop. The while_loop returns the loop variables, which we can evaluate in a tf.Session.

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf

i = tf.constant(0, dtype=tf.int32)
sum = tf.constant(0, dtype=tf.int32)

cond = lambda i, sum: i < 5

def body(i, sum):
    sum = tf.add(sum, i)
    i = tf.add(i, 1)
    return i, sum

_i, _sum = tf.while_loop(cond, body, loop_vars=[i, sum])

with tf.Session() as sess:
    print(_sum.eval())
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
10
#+END_SRC


** Mimicing list comprehension

Consider this list comprehension in Python. It is easy to accomplish the same thing with element-wise operations in numpy.

#+BEGIN_SRC python :results output org drawer
print([i**2 for i in range(5)])

import numpy as np
a = np.arange(5)
print(a**2)
#+END_SRC

#+RESULTS:
:RESULTS:
[0, 1, 4, 9, 16]
[ 0  1  4  9 16]
:END:

We can also use element-wise operations in tensorflow.

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf
a = tf.range(5)

with tf.Session() as sess:
    print(sess.run(a**2))
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
[ 0  1  4  9 16]
#+END_SRC

It is possible to do something more like list comprehension, which can be helpful for more complex operations. To do this, use pydoc:tensorflow.unstack to unpack a tensor into a list of tensors, do the list comprehension on this list, and then use pydoc:tensorflow.stack to put them back together.

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf

a = tf.range(5)

lc = tf.stack([x**2 for x in tf.unstack(a)])

with tf.Session() as sess:
    print(lc.eval())
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
[ 0  1  4  9 16]
#+END_SRC

pydoc:tensorflow.scan

To get this in TF, we can use the tf.scan op. This op takes a function as its first argument, and a sequence as its second argument. The result is obtained by applying the function to each element of the sequence. The function in the first argument should take two arguments, the value from the previous function call, and the current element.

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf

res = tf.scan(lambda acc, curr: curr**2, tf.range(5))

with tf.Session() as sess:
    print(res.eval())
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
[ 0  1  4  9 16]
#+END_SRC

Another approach is to use the tf.map_fn op.

pydoc:tensorflow.map_fn

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf
import numpy as np
X = tf.range(5)

def f(x):
    return x**2

res = tf.map_fn(f, X)

with tf.Session() as sess:
    print(sess.run(res))
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
[ 0  1  4  9 16]
#+END_SRC



You can use the value from the previous call to accumulate something, e.g. a cumulative sum. This is not something that can be done with tf.reduce_sum, for example.

#+BEGIN_SRC python :results output org drawer
import numpy as np
print(np.cumsum(np.arange(5)))
#+END_SRC

#+RESULTS:
:RESULTS:
[ 0  1  3  6 10]
:END:

Tensorflow does have pydoc:tensorflow.cumsum:

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf

res = tf.cumsum(tf.range(5))

with tf.Session() as sess:
    print(res.eval())
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
[ 0  1  3  6 10]
#+END_SRC

But we can create our one version in one line like this.

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf

res = tf.scan(lambda acc, curr: acc + curr, tf.range(5))

with tf.Session() as sess:
    print(res.eval())
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
[ 0  1  3  6 10]
#+END_SRC

** Accumulating a list

Say we want to accumulate a list of even numbers. In Python, we can do it like this.

#+BEGIN_SRC python :results output org drawer
res = []
for i in range(5):
    if i % 2 == 0:
        res += [i]
print(res)
# or like this
print([i for i in range(5) if i % 2 == 0])

# numpy approach
import numpy as np
a = np.arange(5)
print(a[a % 2 == 0])
#+END_SRC

#+RESULTS:
:RESULTS:
[0, 2, 4]
[0, 2, 4]
[0 2 4]
:END:


pydoc:tensorflow.boolean_mask

The best approach is probably the numpy like one using a mask like this. Basically we use it as a filter to select just what we want from a larger list.

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf

a = tf.range(5)
even = tf.equal(tf.mod(a, 2), 0)
res = tf.boolean_mask(a, even)

with tf.Session() as sess:
    print(sess.run(res))
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
[0 2 4]
#+END_SRC

We can also  use a while_loop op.

pydoc:tensorflow.while_loop

We use the tf.while_loop to achieve this. Since we have a list we are accumulating that will change size, we need to use the shape_invariants option in the tf.while_loop. You have to specify some information about each loop variable. The counter i will not change shape, so we just get its shape. The list will change, but we have only one dimension, so we specify the shape in that dimension to be None, indicating we are not saying how big it will get.

The body of this loop took several unsuccessful iterations of more obvious approaches that didn't work. For example, you cannot use standard "if" conditional statements. The tf.cond op here does what we want, calling a true_fn on the condition that i is even, and the false_fn otherwise.

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf

i = tf.constant(0, dtype=tf.int32)
res = tf.Variable([], dtype=tf.int32)

# run the loop as long as i is less than 5.
def cond(i, res):
    return i < 5

# if i is even, add it to the res list, and increment i in the body.
def body(i, res):
    res = tf.cond(tf.equal(i % 2, 0),
                  true_fn=lambda: tf.concat([res, [i]], axis=0),
                  false_fn=lambda: res)

    i = tf.add(i, 1)
    return i, res

counter, loop = tf.while_loop(cond, body, loop_vars=[i, res],
                       shape_invariants=[i.get_shape(), tf.TensorShape(None)])

with tf.Session() as sess:
    print(loop.eval())
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
[0 2 4]
#+END_SRC

** Nested iteration

Consider this nested list prototype where the inner list depends on the value of outer counter.

#+BEGIN_SRC python :results output org drawer
res = []
for i in range(3):
    for j in range(i + 1, 3):
        res += [(i, j)]

print(res)
#+END_SRC

#+RESULTS:
:RESULTS:
[(0, 1), (0, 2), (1, 2)]
:END:

This can be achieved without any loops. We can generate these indices from tensor operations. The idea is to generate all the i, j combinations with a meshgrid, and then find the indices where the condition that j >= i + 1 is true, then use those indices to select the pairs of i and j that apply.

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf
import tensorflow.contrib.eager as tfe

tfe.enable_eager_execution()

i, j = tf.meshgrid(tf.range(3), tf.range(3))
inds = j >= i + 1

res = tf.stack([tf.boolean_mask(i, inds),
                tf.boolean_mask(j, inds)], axis=1)

print(res)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
tf.Tensor(
[[0 1]
 [0 2]
 [1 2]], shape=(3, 2), dtype=int32)
#+END_SRC


It is possible to use nested loops in tensorflow. We have to use shape_invariants since our list is changing size. I was not able to figure out how to get an empty tensor with the required shape, so we initialize a constant with a throw away value, and use indexing at the end.

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf

i = tf.constant(0, dtype=tf.int32)

# Note we initialize with a fake value. I don't know how to specify the shape
# otherwise since it is not 1d.
res = tf.constant([[-1, -1]], dtype=tf.int32)

outer_cond = lambda i, res: i < 3

def outer_body(i, res):
    j = tf.add(i, 1)

    inner_cond = lambda j, res: j < 3
    def inner_body(j, res):
        res = tf.concat([res, [[i, j]]], axis=0)
        j += 1

        return j, res

    j, res = tf.while_loop(inner_cond, inner_body, [j, res],
                           shape_invariants=[j.get_shape(),
                                             tf.TensorShape([None, 2])])
    i += 1
    return i, res

i, res = tf.while_loop(outer_cond, outer_body, [i, res],
                       shape_invariants=[i.get_shape(),
                                         tf.TensorShape([None, 2])])

# Throw away the first row.
res = res[1:, :]

with tf.Session() as sess:
    print(sess.run(res))
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
[[0 1]
 [0 2]
 [1 2]]
#+END_SRC


For fun, we look at an example with a namedtuple, where we will accumulate both even and odd numbers. Here we map over a range of numbers, collecting the odd numbers in one place, and the even numbers in another. This was subtle. We have arrays changing shape inside a named tuple, so we have to use shape_invariants. What was not obvious (or possibly even documented?) is you have to put the shape invariants inside another namedtuple.

#+BEGIN_SRC tf :results output drawer org
import collections
import tensorflow as tf

LV = collections.namedtuple('LoopVariables', 'i, odd, even')

lv0 = LV(tf.constant(0, dtype=tf.int32),
         tf.Variable([], dtype=tf.int32),
         tf.Variable([], dtype=tf.int32))

def cond(nt):
    return nt.i < 11

def body(nt):

    def truef():
        return LV(nt.i + 1, nt.odd, tf.concat([nt.even, [nt.i]], axis=0))

    def falsef():
        return LV(nt.i + 1, tf.concat([nt.odd, [nt.i]], axis=0), nt.even)

    res = tf.cond(tf.equal(tf.mod(nt.i, 2), 0),
                  true_fn=truef,
                  false_fn=falsef)
    return res,


lv1, = tf.while_loop(cond, body, [lv0], shape_invariants=[LV(
    lv0.i.get_shape(), tf.TensorShape(None), tf.TensorShape(None))])


with tf.Session() as sess:
    print(sess.run(lv1))
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
LoopVariables(i=11, odd=array([1, 3, 5, 7, 9], dtype=int32), even=array([ 0,  2,  4,  6,  8, 10], dtype=int32))
#+END_SRC

Finally, what if want to collect numbers into a dynamically determined number of locations? Here we try to split a tensor into N tensors based on the value of each element mod N. We want this to be dynamic, e.g. that we can change N. I don't know a way to access loopvars by either an index, or a named field in Tensorflow, so we have a single list here that we store the index and value, and then after the loop construct the tensors we want. This idea came from Steve Kearnes. Thanks Steve!

#+BEGIN_SRC tf :results output drawer org
import collections
import tensorflow as tf

N = 4

LV = collections.namedtuple('LoopVariables', 'i, tuples')

loopvars = [tf.constant(0, dtype=tf.int32), 
            tf.Variable(tf.zeros((0, 2), dtype=tf.int32), dtype=tf.int32)]

lv0 = LV(*loopvars)

shiv = LV(loopvars[0].get_shape(), tf.TensorShape([None, 2]))

def cond(nt):
    return nt.i < 21

def body(nt):
    i = nt.i   
    n = tf.mod(nt.i, N)
    v = tf.concat([nt.tuples, [[n, i]]], axis=0)
    
    return LV(i + 1, v),

res, = tf.while_loop(cond, body, [lv0], [shiv])

arrs = [tf.gather(res.tuples, tf.where(tf.equal(res.tuples[:, 0], i)))[:, :, 1]
        for i in range(N)]

with tf.Session() as sess:
    sess.run(tf.global_variables_initializer())
    _arrs = sess.run(arrs)
    for i in range(N):
        print(i, _arrs[i].flatten())
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
0 [ 0  4  8 12 16 20]
1 [ 1  5  9 13 17]
2 [ 2  6 10 14 18]
3 [ 3  7 11 15 19]
#+END_SRC



** tf.app
   
Here is a way to use tf.app to make it easy to pass values at the command line.

#+BEGIN_SRC tf :results output drawer org :tangle test.py
import tensorflow as tf

tf.app.flags.DEFINE_boolean("your_flag", False, "A boolean")

FLAGS = tf.app.flags.FLAGS

def main(_):
    print(FLAGS.your_flag)
    a = tf.constant(4)
    a = tf.Print(a, ['Got it'])
    sess = tf.Session()
    print(sess.run(a * a))
    return 

if __name__ == '__main__':
    tf.app.run(main)
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
False
16
#+END_SRC

#+BEGIN_SRC sh
python test.py
#+END_SRC

#+RESULTS:
| False |
|    16 |

#+BEGIN_SRC sh
python test.py --your_flag=True
#+END_SRC

#+RESULTS:
| True |
|   16 |

The help prints on stderr, so we redirect it here.
#+BEGIN_SRC sh :results output
exec 2>&1
python test.py --help
:
#+END_SRC

#+RESULTS:
: 
:        USAGE: test.py [flags]
: flags:
: 
: test.py:
:   --[no]your_flag: A boolean
:     (default: 'false')
: 
: Try --helpfull to get a list of all flags.

** Using Tensorboard
   
[[https://www.tensorflow.org/programmers_guide/summaries_and_tensorboard][Tensorboard]] is a browser-based tool to visualize your Tensorflow programs. You can create summaries of different operations, and view the graph. Usually Tensorboard is used to monitor training, but you can do other things too.

Here is a contrived example where we change a variable and save the changes to Tensorboard.

#+BEGIN_SRC tf :results output drawer org
import tensorflow as tf

v = tf.Variable(0.0, tf.float32)
vsum = tf.summary.scalar("v", v)
summary = tf.summary.merge_all()

with tf.Session() as sess:
    sess.run(tf.global_variables_initializer())
    writer = tf.summary.FileWriter('./summaries', sess.graph)
    
    for i in range(9):
        v = tf.assign(v, float(i**2))
        _v = sess.run(v)
        _summary = sess.run(summary)  # Run this in a separate step
        writer.add_summary(_summary, global_step=i)
        print(i, v.eval())    
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
0 0.0
1 1.0
2 4.0
3 9.0
4 16.0
5 25.0
6 36.0
7 49.0
8 64.0
#+END_SRC

You won't see anything when you run the block above. You have to launch Tensorboard like this:

#+BEGIN_SRC sh
tensorboard --logdir=./summaries --port=6006 &
google-chrome http://localhost:6006
#+END_SRC

#+RESULTS:
| Created new window in existing browser session. |                           |
| TensorBoard attempted to bind to port 6006      | but it was already in use |

Then there will be a web page open to the summary.
